In [1]:
import csv
import pandas as pd
from tfileparser import FileParser # import our custom module
import sqlite3

In [2]:
# CLEAN AND COMBINE THE LISTS OF THE FIVE FILES INTO A LIST OF TUPLES (WORD, WORDCOUNT)
mylist = FileParser.files_to_tuplelist(
    'vocab.nytimes.txt', 
    'vocab.nips.txt', 
    'vocab.kos.txt',
    'vocab.enron.txt',
    'vocab.pubmed.txt'
)

In [4]:
pd.DataFrame(mylist)

                     0  1
0                  aah  2
1                aahed  1
2                aaron  2
3                aback  1
4               abacus  2
...                ... ..
207412  zymosantreated  1
207413      zymosterol  1
207414            zymv  1
207415           zyxin  1
207416              zz  1

[207417 rows x 2 columns]

In [5]:
db = sqlite3.connect('dicodb.db')

In [8]:
# CREATE A NEW TABLE
c = db.cursor()
c.execute('CREATE TABLE wordstab (words text, wordcount integer)')
db.commit()

In [9]:
# SAVE THE content of the merged files list to sqlite database
FileParser.save_to_db(db,'wordstab', mylist)

In [11]:
# LIST OF TUPLES CONTAINING LETTERS AND THE NUMBER OF WORDS STARTING WITH 
# THAT LETTER.
FileParser.word_group_counter('vocab.nytimes.txt')

[('e', 1),
 ('s', 1),
 ('x', 1),
 ('v', 1),
 ('m', 1),
 ('b', 1),
 ('a', 1),
 ('c', 1),
 ('.', 2),
 ('i', 1),
 ('t', 3),
 ('o', 1),
 ('y', 1),
 ('n', 1)]